#language: ru
@ozon
@ozon-categories
Функционал: Переход по категориям внутри каталога

  Сценарий: Переход с основной страницы в подраздел смартфоны
    И кликнуть на кнопку обновить при старте браузера, если необходимо
    И отклонить запрос на добавление адреса, если необходимо
    И открыть каталог
    И перейти в раздел электроники
    И выбрать подраздел смартфоны
    И сменить текущее окно на "Смартфоны – купить телефон на OZON по низкой цене", если необходимо
    И сделать скриншот и назвать его "ozone_smartphones"

  Сценарий: Переход с основной страницы в подраздел женские аквашузы
    И кликнуть на кнопку обновить при старте браузера, если необходимо
    И отклонить запрос на добавление адреса, если необходимо
    И открыть каталог
    И перейти в раздел обувь
    И перейти в подраздел аквашузы
    И сменить текущее окно на "Аквашузы женские – купить резиновые тапочки для купания в море (обувь для моря с галькой) на OZON по низкой цене", если необходимо
    И сделать скриншот и назвать его "подраздел_аквашузы"